# languages.py
# English label → Tamil → Hindi

LANG_MAP = {
    "Church": {
        "ta": "தேவாலயம்",
        "hi": "चर्च"
    },
    "HELLO": {
        "ta": "வணக்கம்",
        "hi": "नमस्ते"
    },
    "Help": {
        "ta": "உதவி",
        "hi": "मदद"
    },
    "Home": {
        "ta": "வீடு",
        "hi": "घर"
    },
    "I love you": {
        "ta": "நான் உன்னை காதலிக்கிறேன்",
        "hi": "मैं तुमसे प्यार करता हूँ"
    },
    "Like": {
        "ta": "பிடிக்கும்",
        "hi": "पसंद"
    },
    "More": {
        "ta": "மேலும்",
        "hi": "और"
    },
    "Name": {
        "ta": "பெயர்",
        "hi": "नाम"
    },
    "No": {
        "ta": "இல்லை",
        "hi": "नहीं"
    },
    "OK": {
        "ta": "சரி",
        "hi": "ठीक है"
    },
    "Pray": {
        "ta": "ஜெபம்",
        "hi": "प्रार्थना"
    },
    "Repeat": {
        "ta": "மீண்டும்",
        "hi": "दोहराना"
    },
    "THANKYOU": {
        "ta": "நன்றி",
        "hi": "धन्यवाद"
    }
}
